#include "boss.h"





MiddleBoss middleBoss[15] =
{
	{"왜군 십인장 타카하시", 30, 8, 4, 2, 4, 4}, {"왜군 십인장 시마무라", 30, 8, 4, 3, 4, 4}, {"왜군 십인장 야마모토", 30, 8, 4, 4, 4, 4}, {"왜군 십인장 키타무라", 30, 8, 4, 5, 4, 4}
	, {"왜군 백인장 후지와라", 40, 10, 6, 3, 5, 5}, {"왜군 백인장 카와사키", 40, 10, 4, 4, 5, 5}, {"왜군 백인장 모리야마", 40, 10, 5, 5, 5, 5}
	, {"왜군 천인장 히라다", 60, 15, 9, 5, 7, 7}, {"왜군 천인장 오오가미", 60, 15, 9, 6, 7, 7}
	, { "왜군 사단장 류노스케", 100, 20, 12, 6, 8, 8 }
};


LastBoss lastBoss[1] =
{
	{"가족의 원수 왜군 군단장 류우가미", 200, 30, 18, 7, 9, 9}
};